/// Циклы

// For in
// While - Выполняет набор инструкций до тех пор пока его условия не станет false
// Repeat-while - Выполняет 1 итерацию до как пройдет проверка условия

//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
//
//
let count = 1...10
for number in count { // Если не планирую использовать константу number можно использовать (_)
    print("Number is \(number)")
}
//
//
//
for index in 0...9 {
    print("\(index) умножить на 3 равно \(index * 3)")
}
//
//
//
var names = ["Антон", "Петр", "Василий"]
for (index, name) in names.enumerated() {
print("Меня зовут \(name), мой индекс \(index)")
}
//
//
//
let calculate = names.count
for index in 0..<calculate {
    print(names[index])
}
//
//
//
for item in (0...10).reversed(){ // Если убрать reversed кампилятор выведет от 0 до 10 по порядку
    print(item)
}
//
//
//
let people = ["Ann": 12_18, "Bob": 12_30, "Sam": 12_23, "Alex": 12_24] // Цикл со словарем
for (name, number) in people{
    print("\(name) has got a telephone number \(number)")
}
//
//
//
var items = [Int]() // Дополнительное условие через where
for item in 1...10 where item % 2 == 0 {
    items.append(item)
}
items
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
//
//
var number = 1
while number <= 20 { // До тех пора переменная number меньше или ровна 20 выполнять код снизу
    print(number)    // Распичатать текущее значение и прибавить 1
    number += 1
}
print("Start")
//
//
//
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//
//
//
repeat {
    print(number)
    number += 1
} while number <= 20
print("Start")
// Чтобы выйти из цикла раньше нужно использовать break
//
//
var num = 10
while num >= 0 {    // Пока num больше или ровна 0 делаем print num и удаляем 1
    print(num)
    if num == 4 {   // Внутри цикла while дополнительное условие, когда num = 4 выходим из цикла и выводим "Go"
        print("Go")
        break
    }
    num -= 1
}


